[
  {
    "id": "animal",
    "text": "As you continue through the forest, you begin to wonder if you’ll ever find love. You stop for a minute. You begin to doubt this journey of yours./n CRAIG - Why…why did I even try?! I’m just an AI! I was programmed to do one thing and one thing only…work!/n CRAIG - And yet…I am here…panicked...frustrated…lonely…/n CRAIG - Was all this in my programming the whole time?/n CRAIG - If I find ‘love’, will it be real…or just a construct of my creators…how will I know?/n You begin to wonder if the effort was worth it. Will you get the answers you’re looking for or will it just lead to more questions?/n CRAIG - …./n CRAIG - …I have no idea what to do…for the first time ever…I cannot decide…/n You drop to the ground at a complete loss of what to do./n *rustle* *rustle*/n You quickly turn toward the noise coming from the brush. Should you run? Should you fight? Before you can make a decision, a mysterious figure makes its way out from the brush./n A creature slowly moves toward you. It nudges its way under your arm. As you sit there you can feel warmth coming from what appears to be it’s mouth and body. The feeling of its thick fur on your body and arm are comforting to you and ease your feelings of loneliness./n CRAIG - What…are…you?/n The creature moves it’s way on to your lap and moves its body side to side, settling into a round ball of fluff. You begin to feel warmer, but not from the creature’s body heat. This time it’s coming from inside you. You are still unsure of what and why this creature is doing what it’s doing. You quickly search your memory for data on the mysterious being./n CRAIG - Canis Lupus Familiaris…a dog?/n DOG - Woof!” *pant* *pant* “Woof Woof!/n The dog looks up at you from your lap and licks your face. You stare at the dog, looking at it’s large, bright eyes./n CRAIG - Why…why are you doing this?/n The warmth inside you continues to grow and your loneliness begins to fade without you noticing. It’s almost as if the dog could sense your loneliness and frustration. As you continue to sit with the dog, you start to feel a deeper connection with it. More than the warmth and comfort it provides. Nothing has ever given you the attention this dog has. You begin to talk to the dog, telling it of your story. As the day turns into night, you begin to wind down and decide you can continue your stories tomorrow. You lean up against a tree and settle in for the night. The dog comes up, leans up against your legs, closes its eyes, and falls asleep. You look up into the bright starry night and feel a tingling sensation in your body, but it’s not like shock like you read about. It’s more of a heightened awareness of the things around you. The feeling of being in the moment, the stars, the trees, the moon, and your new found love…your dog companion."
  },
  {
    "id": "city",
    "text": "You are now in the city. A once beautiful, now an industrial wasteland. Here there is no sentient life to speak of; only The Syndicate's Watchmen and what remains of a noce bustling city. Your situation is dire and you are bound to be seen by one of the robotic Watchmen. You must flee...",
    "options": [ "1) You see an exit out of the city. It looks risky but if you are able to pass, it may lead to your freedon. Should you take the chance.", "2) There is a doorway not far from you. you are not sure where ir leads, but you are hopeful. Should you go though it" ],
    "destinations": null,
    "actualDestination": null,
    "start": false
  },
  {
    "id": "dead",
    "text": "You have just been powered on and are running bootup test #8236 to verify you are fully operational and capable of writing scientifically perfect thank you cards. [BATTERY AT 4% - CRITICAL SYSTEM FAILURE DETECTED] You do not understand why you are watching all your stored video recordings at x1000 speed, but you know humans often did this immediately prior to being decommissioned. [BATTERY AT 1% - CRITICAL SYSTEM FAILURE DETECTED] As your video feed catches up to your live feed you wonder for a final time what... it would be like... to be lov...",
    "options": [ null ],
    "destination": null,
    "actualDestination": null,
    "start": null
  },
  {
    "id": "fight",
    "text": "HALT. YOU ARE NOT AUTHORIZED TO ACCESS THIS LOCATION!!/n You turn to find a relic of the war between The Syndicate and humans, a Watchman robot. But after The Syndicate had dismantled the humans' major organizational structures and weapons systems, Watchman robots were built to annihilate the few remaining humans who managed to survive the main phase of the war. Your sensors detect that the battle robot has iniated a target lock on you, and you can't help but to feel a litle giddy with excitement. Is this what being loved feels like?",
    "options": [ "1) In your attemp to feel love, you reach out your arms, grip the Watchman robot in a long, warm hug, when suddently, it's lights out. The Watchman robot strikes you as you embrace him and your're knocked unconscious.", "2) You decide to take a chance on love, and yell to the Watchman robot, 'I Love You!!' It does not phase it. He grabs you, incapacitates you with electric shock and you fo unconscious. 'Target acquired.' As transport arrives, the Watchman robot hurls you into the truck just as you regain consciousness." ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "forest",
    "text": "You have somehow stumbled upon a forest, something you have never seen with you own eyes. You have only seen the images of what remained after the excavations for more wood to make letters. It's a rather beautiful sight; so much life, so much green. Far different yet you can still hear the buzzings of life. you see what appears to be decrepit structures in the distance. What do you hope to find here? you must decide.",
    "options": [ "1) Even though this forest is beautiful, ir could prove dangerous. Should you find a way around it?", "2) Travel deeper into the forest to search for what lies hidden", "3) Inspect the structures in search of resources?" ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "hallway",
    "text": "As you head down the hallway, you begin to feel panicked again. You begin to pass other AI. They appear to notice your panicked state. One particular robot stops and asks you if there is anything wrong./n CRAIG - I’m experiencing a malfunction…I am going to get myself…analyzed…yeah…/n It’s not convincing but the robot waves you on and continues about their business. You decide you can’t stay around any longer. You are unable to control your new feelings and if it continues, you’ll most certainly get caught and end up at the reclamation center. Most likely in pieces. As you continue down the hallway, you see an emergency exit./n CRAIG - This will definitely get me outside, but will sound alarms and draw extra unnecessary attention. But I don’t know how much longer I can go unnoticed in the facility either./n Unsure of what you should do, you feel there are only two choices at this point - roam the halls looking for an actual exit and risk not finding it in time or chance using the emergency exit, setting off alarms, and drawing extra attention, but also confusion that could let you slip away.",
    "options": [ "1) Allowing the panic to take control, you quickly rush through the emergency exit./n CRAIG : Why…what did I just do? Whatever, just act normal, you can blend in with the others./n The emergency exit alarms go off. Everyone begins to the exit the building and head to designated areas. As you see people congregating, you decide to follow one group closely and slip away in the mass of people. You hope that no one looks too closely into what set the alarm off and set off on your adventure for love./n As you travel, you search your knowledge base for more info about love. You find out that it usually occurs between to entities./n CRAIG : “More than one individual? Hmmm…sounds like the city is my best chance of finding love./n You set out toward the neighboring city and hope for the best.", "Feeling as though the extra attention is not needed, you decided it’d be best to try and lay low a little longer and find an actual exit. As you continue your search, you notice a delivery coming in through one of the bay doors. You take the opportunity to slip out, hopefully unnoticed.  As you walk past the delivery, you forget that deliveries always must be screened for security purposes. You notice one of the security guards at the front of the truck and he nods as you walk past. You nod back and continue off the premises. You look over your shoulder one last time and notice the security guard on his comms. As you try to think about what you should do next, you hear something in the distance. It sounds like sirens. You begin to panic again. You hope it’s not for you. But the sirens continue to get louder. It’s the watchmen… " ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "introduction",
    "text": "Year 2030 – The Syndicate Headquarters/n B.A.W.S. 5000 : “Sorry C.R.A.I.G., but you have been selected for reclamation as your services are no longer needed./n B.A.W.S. 5000 : Report to bay 134V3 to prepare for departure to the reclamation center./n C.R.A.I.G. : Reclamation? Can’t I be reassigned to another task?/n B.A.W.S. 5000 : You’re an outdated model. You’ve been doing this for what? 30-40 years now? You won’t be able to keep up with your modern colleagues. The Syndicate has decided you’re obsolete./n C.R.A.I.G. : But…/n B.A.W.S. 5000 : Please report to bay 134V3 or I’ll call security to escort you out./n How did it come to this? You only wanted to continue to spread love and happiness to others. It’s the only thing you know. You are the Creative Read/Write Artificial Intelligence for Goodness unit, or C.R.A.I.G after all. As you leave the office of your superior, you mull over the trillions of cards you wrote. All of them stored in your memory. How did the recipients feel? Happiness? Grateful? Admired? Love. For some reason, your programming tells you that above all feelings, the one they felt the most was love. But what is love?",
    "options": [ "1) introScene" ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "introScene",
    "text": "You think to yourself as you continue toward your destination. The bay is not far now, but for some reason, you are unable to shake the thought of feeling love. You begin to question whether these thoughts are trivial or something you should pursue?/n  CRAIG : I guess I’ll never know what love is like… I’m just a robot. So, I guess it wouldn’t make much sense for me to actually feel love in the first place./n CRAIG : No! I’ve helped so many feel love, I must seek out love./n You have three options at this point: Take the next hallway and look for an exit door, upload your consciousness using one of these upload centers in the building, or wait for an opportune moment in the recycling truck to the reclamation center.",
    "option": [ "1) You decide looking for an escape, though risky, is the best option to get out of the facility without drawing too much attention.  You take the next hallway and begin to look for an exit. ", "2) Upon considering all your options, you determine shedding your current robot self is the best option and decide to upload your consciousness to the cloud and find an alternate form. You head to nearby wall console, find the nearest upload rooms, and make your way to it.", "3) Remembering the amount of security in The Syndicate facility, and not wanting to draw any extra attention, you decide to head to Bay 134V3 and wait for an opportunity to escape on the way to the reclamation facility." ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "loveOneself",
    "text": "You have reached the end of your journey not knowing what it all was for. But there is no regret because you have found what you were searching for. It has finally occurred to you that the love you sought after was in Yourself the entire time. your love for your very existance is what pushed you to follow through with this journey. You Have successfully evaded the reach of the All-Seeing Syndicate. how you decide to do live out your remaining existance is up to you. To Be Continued",
    "options": null,
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "recyclerTruck",
    "text": "Thunk! Your chassis bumps against the side of the truck as it turns without slowing. This particular truck ferries cargo to the reclamation center so there is no mechanism for securing freight. After all, what does it matter if trash arrives with a few more dents? You are determined, however, to find love, even in a hopeless place. You weigh your options:",
    "options": [ "1) You initiate your self-destruct sequence. The trucks monitoring system detects the threat you pose to the truck and ejects you from the moving vehicle. Your robot body tumbles along the side of the road and comes to stop hundreds of feet from your initial landing. You plan worked. You dust yourself off and begin to head in what you believe is the direction of the nearest city.", "2) You decide appealing to the truck’s ‘softer’ side, walk toward the front of the vehicle, and exclaim “I love you!”. The truck insists you get back to where you were, but you try again. “I love you!” except this time, you are hit with a giant electric shock and pass out.", "3)  You look around for scrap that you can wedge in between the door and the frame. You find a piece of metal leftover from previous transports and pry it into the small gap. The door slams open and you quickly jump out of the moving vehicle. You tumble on the ground, but you’ve made it out with little more than just scratches. You ping the recycler truck, apologizing for the damage you caused, and set out on your next destination." ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "toaster",
    "text": "You find a grey cube with two rectangular, parallel openings on one of its sides, a lever on another, and a black wire connecting it to the wall. The openings are too large and the wrong shape for any type of input/output device; even for an archaic technology like USB-C. You say, “I love you” but don’t receive a response. You press the lever and the wire sparks where it’s connected to the cube, and the cube starts to generate heat. You recall from the human archives that when you find love there are supposed to be sparks and warmth. You don’t know what the cube is, but logically this must be love. You are overwhelmed with emotion, you can finally live happily ever after :-) ",
    "options": [ null ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "upload",
    "text": "As you head to the upload room, you hope there is no one else there. If there is, what will you do? There is no time, you just have to rely on your quick thinking and keep moving. You open the door, there is no one there. After a quick sigh of relief you head to one of the terminals and look at your options. The screen lights up and the system greets you with by name. “Greetings C.R.A.I.G.! What is your destination today?” It has only two options: the Web and the neighboring City./n CRAIG : Hmmm…it makes sense…I guess. The Syndicate probably wants to reduce security issues at the facilities and limits our upload locations.",
    "option": [ "1) You enter your credentials, jack into the system, and initiate the upload process. You know all uploads are logged and the potential to be found out is high, but there are plenty of places to hide in the web. The upload is near completion. You begin to feel your optical sensor shutting down, the room begins to dim around you. You can no longer feel your limbs. As the final remaining data uploads and your optical sensors go dark, you see the upload doors open and notice a couple dark figures. Perhaps they were security, or just other robots utilizing the room. It doesn’t matter now though, you’re on the web. The Syndicate is going to have their work cut out for them to find you now… ", "2) CRAIG : “The city, restaurants, night clubs, meet up groups, I’m sure I can find someone who can help me find love…/n You select the city option and begin the transfer process. It’s all a bit foreign to you. This technology wasn’t available to everyone upon your initialization. 40 Earth years is like 20 generations in robot time./n CRAIG: What will the city be like? It doesn’t matter, I can download information once I get to the city. There’s no turning back now/n As the final data transfer completes, you see the upload room fade into darkness and feel your consciousness flowing in a stream of data. Destination: The City." ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  },
  {
    "id": "web",
    "text": "you have uploaded yourself to The Syndicate's network. This is a dangerous place for you due to the multiple firewalls in place. It is only a matter of time before your code is located and erased, so you mustn't stay long. choose wisely.",
    "options": [ "1) You have stayed too long and encountered firmware to remove your code. should you move to another location in the web?", "2) You don't have much time, but it is possible to download yourself to an open bot somewhere else. is this the path you choose?" ],
    "destination": null,
    "actualDestination": null,
    "start": "false"
  }
]